vmux0.0.10-pre/ycsbVMs_ycsb_32vms_vmux-med_-1rps_rep1/vm21.log
/nix/store/2vwkssqpzykk37r996cafq7x63imf4sp-openjdk-21+35/bin/java  -classpath /nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/conf:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/core-0.17.0.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/HdrHistogram-2.1.4.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/htrace-core4-4.1.0-incubating.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/jackson-core-asl-1.9.4.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/jackson-mapper-asl-1.9.4.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/redis-binding/lib/commons-pool2-2.4.2.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/redis-binding/lib/jedis-2.9.0.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/redis-binding/lib/redis-binding-0.17.0.jar site.ycsb.Client -t -db site.ycsb.db.RedisClient -s -P /home/host/vmuxIO/test/moonprogs//../../ycsb/share/workloads/workloada -p redis.host=10.1.0.2 -p redis.port=6387 -p operationcount=429496729 -p maxexecutiontime=61 -threads 1
Command line: -t -db site.ycsb.db.RedisClient -s -P /home/host/vmuxIO/test/moonprogs//../../ycsb/share/workloads/workloada -p redis.host=10.1.0.2 -p redis.port=6387 -p operationcount=429496729 -p maxexecutiontime=61 -threads 1
YCSB Client 0.17.0

Loading workload...
Starting test.
Maximum execution time specified as: 61 secs
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2024-08-21 19:10:09:217 0 sec: 0 operations; est completion in 0 second 
2024-08-21 19:10:19:019 10 sec: 41131 operations; 4113.1 current ops/sec; est completion in 1 day 5 hours [READ: Count=20587, Max=59071, Min=107, Avg=236.53, 90=357, 99=517, 99.9=2843, 99.99=9079] [UPDATE: Count=20551, Max=10831, Min=114, Avg=230.69, 90=351, 99=511, 99.9=2889, 99.99=7395] 
2024-08-21 19:10:29:019 20 sec: 89766 operations; 4863.5 current ops/sec; est completion in 1 day 2 hours [READ: Count=24603, Max=3997, Min=106, Avg=205.84, 90=294, 99=440, 99.9=569, 99.99=2699] [UPDATE: Count=24025, Max=3619, Min=107, Avg=199.14, 90=284, 99=436, 99.9=560, 99.99=3013] 
2024-08-21 19:10:39:019 30 sec: 138322 operations; 4855.6 current ops/sec; est completion in 1 day 1 hour [READ: Count=24222, Max=7259, Min=111, Avg=207.35, 90=302, 99=448, 99.9=652, 99.99=4235] [UPDATE: Count=24334, Max=3191, Min=112, Avg=200.23, 90=292, 99=436, 99.9=574, 99.99=2585] 
2024-08-21 19:10:49:019 40 sec: 188934 operations; 5061.2 current ops/sec; est completion in 1 day 1 hour [READ: Count=25225, Max=4151, Min=104, Avg=198.52, 90=288, 99=420, 99.9=549, 99.99=2331] [UPDATE: Count=25387, Max=8647, Min=102, Avg=192.75, 90=283, 99=414, 99.9=505, 99.99=2475] 
2024-08-21 19:10:59:019 50 sec: 238989 operations; 5005.5 current ops/sec; est completion in 1 day [READ: Count=25083, Max=4579, Min=106, Avg=201.06, 90=286, 99=437, 99.9=567, 99.99=2609] [UPDATE: Count=24972, Max=3131, Min=102, Avg=194.4, 90=278, 99=431, 99.9=559, 99.99=1903] 
2024-08-21 19:11:09:019 60 sec: 286317 operations; 4732.8 current ops/sec; est completion in 1 day [READ: Count=23710, Max=8075, Min=103, Avg=212.1, 90=304, 99=450, 99.9=572, 99.99=2633] [UPDATE: Count=23618, Max=4543, Min=96, Avg=206.35, 90=303, 99=442, 99.9=559, 99.99=2909] 
Maximum time elapsed. Requesting stop for the workload.
Stop requested for workload. Now Joining!
2024-08-21 19:11:10:032 61 sec: 290303 operations; 3938.74 current ops/sec; est completion in 1 day 1 hour [READ: Count=2041, Max=5091, Min=119, Avg=254.12, 90=383, 99=484, 99.9=598, 99.99=5091] [CLEANUP: Count=1, Max=884, Min=884, Avg=884, 90=884, 99=884, 99.9=884, 99.99=884] [UPDATE: Count=1945, Max=2447, Min=116, Avg=248.82, 90=374, 99=483, 99.9=597, 99.99=2447] 
[OVERALL], RunTime(ms), 61018
[OVERALL], Throughput(ops/sec), 4757.66167360451
[TOTAL_GCS_Copy], Count, 27
[TOTAL_GC_TIME_Copy], Time(ms), 26
[TOTAL_GC_TIME_%_Copy], Time(%), 0.042610377265724864
[TOTAL_GCS_MarkSweepCompact], Count, 0
[TOTAL_GC_TIME_MarkSweepCompact], Time(ms), 0
[TOTAL_GC_TIME_%_MarkSweepCompact], Time(%), 0.0
[TOTAL_GCs], Count, 27
[TOTAL_GC_TIME], Time(ms), 26
[TOTAL_GC_TIME_%], Time(%), 0.042610377265724864
[READ], Operations, 145471
[READ], AverageLatency(us), 210.03813818561775
[READ], MinLatency(us), 103
[READ], MaxLatency(us), 59071
[READ], 95thPercentileLatency(us), 368
[READ], 99thPercentileLatency(us), 452
[READ], Return=OK, 145471
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 884.0
[CLEANUP], MinLatency(us), 884
[CLEANUP], MaxLatency(us), 884
[CLEANUP], 95thPercentileLatency(us), 884
[CLEANUP], 99thPercentileLatency(us), 884
[UPDATE], Operations, 144832
[UPDATE], AverageLatency(us), 203.70570730225364
[UPDATE], MinLatency(us), 96
[UPDATE], MaxLatency(us), 10831
[UPDATE], 95thPercentileLatency(us), 361
[UPDATE], 99thPercentileLatency(us), 444
[UPDATE], Return=OK, 144832
AUTOTEST_DONE